app/controllers/shoppings_controller.rb

  def create
    @shop = Shopping.new(shopping_params)
    @shop.image.attach(params[:shopping][:image])
---
INSERT INTO "shoppings" ("item") VALUES (?)  [["item", "Milk"]]

  def show
    @shop = Shopping.find(params[:id])
---
SELECT  "shoppings".* FROM "shoppings" WHERE "shoppings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def edit
    @shop = Shopping.find(params[:id])
---
SELECT  "shoppings".* FROM "shoppings" WHERE "shoppings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @shop = Shopping.find(params[:id])
---
SELECT  "shoppings".* FROM "shoppings" WHERE "shoppings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @shop = Shopping.all
---
SELECT "shoppings".* FROM "shoppings"

  def destroy
    @shop = Shopping.find(params[:id])
    @shop.destroy
---
SELECT  "shoppings".* FROM "shoppings" WHERE "shoppings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "shoppings" WHERE "shoppings"."id" = ?  [["id", 2]]